// Реализуйте класс “Студент”. Необходимо хранить в переменных-членах класса: ФИО, дату рождения, 
// контактный телефон, город, страну, название учебного заведения, город и страну (где находится учебное заведение), 
// номер группы. Реализуйте функции-члены класса для ввода данных, вывода данных, реализуйте аксессоры для 
// доступа к отдельным переменным-членам. К уже реализованному классу Student добавьте необходимые конструкторы.

class Program
{
    static void Main(string[] args)
    {
        
    }
}